-- MySQL dump 10.13  Distrib 5.5.37, for debian-linux-gnu (i686)
--
-- Host: localhost    Database: nix
-- ------------------------------------------------------
-- Server version	5.5.37-0ubuntu0.14.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cities` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `province_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `index_cities_on_province_id` (`province_id`),
  KEY `index_cities_on_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=372 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES (1,'北京市',1),(2,'天津市',2),(3,'上海市',9),(4,'重庆市',27),(5,'邯郸市',3),(6,'石家庄市',3),(7,'保定市',3),(8,'张家口市',3),(9,'承德市',3),(10,'唐山市',3),(11,'廊坊市',3),(12,'沧州市',3),(13,'衡水市',3),(14,'邢台市',3),(15,'秦皇岛市',3),(16,'朔州市',4),(17,'忻州市',4),(18,'太原市',4),(19,'大同市',4),(20,'阳泉市',4),(21,'晋中市',4),(22,'长治市',4),(23,'晋城市',4),(24,'临汾市',4),(25,'吕梁市',4),(26,'运城市',4),(27,'沈阳市',6),(28,'铁岭市',6),(29,'大连市',6),(30,'鞍山市',6),(31,'抚顺市',6),(32,'本溪市',6),(33,'丹东市',6),(34,'锦州市',6),(35,'营口市',6),(36,'阜新市',6),(37,'辽阳市',6),(38,'朝阳市',6),(39,'盘锦市',6),(40,'葫芦岛市',6),(41,'长春市',7),(42,'吉林市',7),(43,'延边朝鲜族自治州',7),(44,'四平市',7),(45,'通化市',7),(46,'白城市',7),(47,'辽源市',7),(48,'松原市',7),(49,'白山市',7),(50,'哈尔滨市',8),(51,'齐齐哈尔市',8),(52,'鸡西市',8),(53,'牡丹江市',8),(54,'七台河市',8),(55,'佳木斯市',8),(56,'鹤岗市',8),(57,'双鸭山市',8),(58,'绥化市',8),(59,'黑河市',8),(60,'大兴安岭地区',8),(61,'伊春市',8),(62,'大庆市',8),(63,'南京市',10),(64,'无锡市',10),(65,'镇江市',10),(66,'苏州市',10),(67,'南通市',10),(68,'扬州市',10),(69,'盐城市',10),(70,'徐州市',10),(71,'淮安市',10),(72,'连云港市',10),(73,'常州市',10),(74,'泰州市',10),(75,'宿迁市',10),(76,'舟山市',11),(77,'衢州市',11),(78,'杭州市',11),(79,'湖州市',11),(80,'嘉兴市',11),(81,'宁波市',11),(82,'绍兴市',11),(83,'温州市',11),(84,'丽水市',11),(85,'金华市',11),(86,'台州市',11),(87,'合肥市',12),(88,'芜湖市',12),(89,'蚌埠市',12),(90,'淮南市',12),(91,'马鞍山市',12),(92,'淮北市',12),(93,'铜陵市',12),(94,'安庆市',12),(95,'黄山市',12),(96,'滁州市',12),(97,'阜阳市',12),(98,'宿州市',12),(99,'巢湖市',12),(100,'六安市',12),(101,'亳州市',12),(102,'池州市',12),(103,'宣城市',12),(104,'福州市',13),(105,'厦门市',13),(106,'宁德市',13),(107,'莆田市',13),(108,'泉州市',13),(109,'漳州市',13),(110,'龙岩市',13),(111,'三明市',13),(112,'南平市',13),(113,'鹰潭市',14),(114,'新余市',14),(115,'南昌市',14),(116,'九江市',14),(117,'上饶市',14),(118,'抚州市',14),(119,'宜春市',14),(120,'吉安市',14),(121,'赣州市',14),(122,'景德镇市',14),(123,'萍乡市',14),(124,'菏泽市',15),(125,'济南市',15),(126,'青岛市',15),(127,'淄博市',15),(128,'德州市',15),(129,'烟台市',15),(130,'潍坊市',15),(131,'济宁市',15),(132,'泰安市',15),(133,'临沂市',15),(134,'滨州市',15),(135,'东营市',15),(136,'威海市',15),(137,'枣庄市',15),(138,'日照市',15),(139,'莱芜市',15),(140,'聊城市',15),(141,'商丘市',16),(142,'郑州市',16),(143,'安阳市',16),(144,'新乡市',16),(145,'许昌市',16),(146,'平顶山市',16),(147,'信阳市',16),(148,'南阳市',16),(149,'开封市',16),(150,'洛阳市',16),(151,'济源市',16),(152,'焦作市',16),(153,'鹤壁市',16),(154,'濮阳市',16),(155,'周口市',16),(156,'漯河市',16),(157,'驻马店市',16),(158,'三门峡市',16),(159,'武汉市',17),(160,'襄樊市',17),(161,'鄂州市',17),(162,'孝感市',17),(163,'黄冈市',17),(164,'黄石市',17),(165,'咸宁市',17),(166,'荆州市',17),(167,'宜昌市',17),(168,'恩施土家族苗族自治州',17),(169,'神农架林区',17),(170,'十堰市',17),(171,'随州市',17),(172,'荆门市',17),(173,'仙桃市',17),(174,'天门市',17),(175,'潜江市',17),(176,'岳阳市',18),(177,'长沙市',18),(178,'湘潭市',18),(179,'株洲市',18),(180,'衡阳市',18),(181,'郴州市',18),(182,'常德市',18),(183,'益阳市',18),(184,'娄底市',18),(185,'邵阳市',18),(186,'湘西土家族苗族自治州',18),(187,'张家界市',18),(188,'怀化市',18),(189,'永州市',18),(190,'广州市',19),(191,'汕尾市',19),(192,'阳江市',19),(193,'揭阳市',19),(194,'茂名市',19),(195,'惠州市',19),(196,'江门市',19),(197,'韶关市',19),(198,'梅州市',19),(199,'汕头市',19),(200,'深圳市',19),(201,'珠海市',19),(202,'佛山市',19),(203,'肇庆市',19),(204,'湛江市',19),(205,'中山市',19),(206,'河源市',19),(207,'清远市',19),(208,'云浮市',19),(209,'潮州市',19),(210,'东莞市',19),(211,'兰州市',22),(212,'金昌市',22),(213,'白银市',22),(214,'天水市',22),(215,'嘉峪关市',22),(216,'武威市',22),(217,'张掖市',22),(218,'平凉市',22),(219,'酒泉市',22),(220,'庆阳市',22),(221,'定西市',22),(222,'陇南市',22),(223,'临夏回族自治州',22),(224,'甘南藏族自治州',22),(225,'成都市',28),(226,'攀枝花市',28),(227,'自贡市',28),(228,'绵阳市',28),(229,'南充市',28),(230,'达州市',28),(231,'遂宁市',28),(232,'广安市',28),(233,'巴中市',28),(234,'泸州市',28),(235,'宜宾市',28),(236,'资阳市',28),(237,'内江市',28),(238,'乐山市',28),(239,'眉山市',28),(240,'凉山彝族自治州',28),(241,'雅安市',28),(242,'甘孜藏族自治州',28),(243,'阿坝藏族羌族自治州',28),(244,'德阳市',28),(245,'广元市',28),(246,'贵阳市',29),(247,'遵义市',29),(248,'安顺市',29),(249,'黔南布依族苗族自治州',29),(250,'黔东南苗族侗族自治州',29),(251,'铜仁地区',29),(252,'毕节地区',29),(253,'六盘水市',29),(254,'黔西南布依族苗族自治州',29),(255,'海口市',20),(256,'三亚市',20),(257,'五指山市',20),(258,'琼海市',20),(259,'儋州市',20),(260,'文昌市',20),(261,'万宁市',20),(262,'东方市',20),(263,'澄迈县',20),(264,'定安县',20),(265,'屯昌县',20),(266,'临高县',20),(267,'白沙黎族自治县',20),(268,'昌江黎族自治县',20),(269,'乐东黎族自治县',20),(270,'陵水黎族自治县',20),(271,'保亭黎族苗族自治县',20),(272,'琼中黎族苗族自治县',20),(273,'西双版纳傣族自治州',30),(274,'德宏傣族景颇族自治州',30),(275,'昭通市',30),(276,'昆明市',30),(277,'大理白族自治州',30),(278,'红河哈尼族彝族自治州',30),(279,'曲靖市',30),(280,'保山市',30),(281,'文山壮族苗族自治州',30),(282,'玉溪市',30),(283,'楚雄彝族自治州',30),(284,'普洱市',30),(285,'临沧市',30),(286,'怒江傈傈族自治州',30),(287,'迪庆藏族自治州',30),(288,'丽江市',30),(289,'海北藏族自治州',25),(290,'西宁市',25),(291,'海东地区',25),(292,'黄南藏族自治州',25),(293,'海南藏族自治州',25),(294,'果洛藏族自治州',25),(295,'玉树藏族自治州',25),(296,'海西蒙古族藏族自治州',25),(297,'西安市',23),(298,'咸阳市',23),(299,'延安市',23),(300,'榆林市',23),(301,'渭南市',23),(302,'商洛市',23),(303,'安康市',23),(304,'汉中市',23),(305,'宝鸡市',23),(306,'铜川市',23),(307,'防城港市',21),(308,'南宁市',21),(309,'崇左市',21),(310,'来宾市',21),(311,'柳州市',21),(312,'桂林市',21),(313,'梧州市',21),(314,'贺州市',21),(315,'贵港市',21),(316,'玉林市',21),(317,'百色市',21),(318,'钦州市',21),(319,'河池市',21),(320,'北海市',21),(321,'拉萨市',31),(322,'日喀则地区',31),(323,'山南地区',31),(324,'林芝地区',31),(325,'昌都地区',31),(326,'那曲地区',31),(327,'阿里地区',31),(328,'银川市',26),(329,'石嘴山市',26),(330,'吴忠市',26),(331,'固原市',26),(332,'中卫市',26),(333,'塔城地区',24),(334,'哈密地区',24),(335,'和田地区',24),(336,'阿勒泰地区',24),(337,'克孜勒苏柯尔克孜自治州',24),(338,'博尔塔拉蒙古自治州',24),(339,'克拉玛依市',24),(340,'乌鲁木齐市',24),(341,'石河子市',24),(342,'昌吉回族自治州',24),(343,'五家渠市',24),(344,'吐鲁番地区',24),(345,'巴音郭楞蒙古自治州',24),(346,'阿克苏地区',24),(347,'阿拉尔市',24),(348,'喀什地区',24),(349,'图木舒克市',24),(350,'伊犁哈萨克自治州',24),(351,'呼伦贝尔市',5),(352,'呼和浩特市',5),(353,'包头市',5),(354,'乌海市',5),(355,'乌兰察布市',5),(356,'通辽市',5),(357,'赤峰市',5),(358,'鄂尔多斯市',5),(359,'巴彦淖尔市',5),(360,'锡林郭勒盟',5),(361,'兴安盟',5),(362,'阿拉善盟',5),(363,'台北市',32),(364,'高雄市',32),(365,'基隆市',32),(366,'台中市',32),(367,'台南市',32),(368,'新竹市',32),(369,'嘉义市',32),(370,'澳门特别行政区',33),(371,'香港特别行政区',34);
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2014-05-26 17:07:47
