class Province < ActiveRecord::Base
   attr_accessible :name, :remark,:region_id
   has_many :cities
   belongs_to :region

  def self.init_provinces

    attr = [['北京市','1','直辖市'],
            ['天津市','1','直辖市'],
            ['河北省','1','省份'],
            ['山西省','1','省份'],
            ['内蒙古自治区','1','自治区'],
            ['辽宁省','2','省份'],
            ['吉林省','2','省份'],
            ['黑龙江省','2','省份'],
            ['上海市','3','直辖市'],
            ['江苏省','3','省份'],
            ['浙江省','3','省份'],
            ['安徽省','3','省份'],
            ['福建省','3','省份'],
            ['江西省','3','省份'],
            ['山东省','3','省份'],
            ['河南省','5','省份'],
            ['湖北省','5','省份'],
            ['湖南省','5','省份'],
            ['广东省','5','省份'],
            ['海南省','5','省份'],
            ['广西壮族自治区','5','自治区'],
            ['甘肃省','6','省份'],
            ['陕西省','6','省份'],
            ['新疆维吾尔自治区','6','自治区'],
            ['青海省','6','省份'],
            ['宁夏回族自治区','6','自治区'],
            ['重庆市','4','直辖市'],
            ['四川省','4','省份'],
            ['贵州省','4','省份'],
            ['云南省','4','省份'],
            ['西藏自治区','4','自治区'],
            ['台湾省','7','省份'],
            ['澳门特别行政区','7','特别行政区'],
            ['香港特别行政区','7','特别行政区']]
    attr.each do |p|
      #Province.create!({:name=>p[0],:remark=>p[2]})

Province.create!({:name=>p[0],:remark=>p[2],:region_id=>p[1].to_i})
    end
    puts 'create end....'
  end
end
